Repository: beatussum/defragall
Catalog: i18n/*.po
Languages: fr

source: Defragment all mounted btrfs subvolumes.
fr: Défragmente tous les sous-volumes btrfs montés.

source: -h : print this message
fr: -h : affiche ce message

source: -v : print the program version
fr: -v : affiche la version du programme

source: -n : not to be verbose
fr: -n : affiche moins de détail

source: -c<zlib,lzo,zstd> : compress the file while defragmenting
fr: -c<zlib,lzo,zstd> : compresse le fichier pendant la défragmentation

source: -f : flush data to disk immediately after defragmenting
fr: -f : Nettoie les données du disque immédiatement après la défragmentation

source: -s <start> : defragment only from byte onward
fr: -s <start> : défragmente uniquement à partir de l'octet suivant

source: -l <len> : defragment only up to 'len' bytes
fr: -l <len> : défragmente seulement jusqu'à 'len' octets

source: -t <size> : target extent 'size' hint
fr: -t <size> : étendue de la cible 'size' indice

source: see 'btrfs filesystem defragment --help' for more details
fr: voir 'btrfs filesystem defragment --help' pour plus de dtails

source: Getting the list of mounted subvolumes...
fr: Obtention de la liste des sous-volumes montés...

source: Log:
fr: Fichier de rapport :

source: Starting the defragmentation process...
fr: Démarrage du processus de défragmentation...

source: Do you want to continue? [N/y]
fr: Voulez-vous continuer ? [N/o]

source: Y
fr: O

source: y
fr: o

source: Defragmentation complete
fr: Défragmentation terminée

source: is not a correct algorithm
fr: n'est pas un algorithme correct

source: This operation must be executed with root rights
fr: Cette opration doit être excutée avec les droits root
